{"posts":[{"title":"CURRICULUM VITAE","text":"Author: Tianyu Fu I am a PhD Candidate at Tianjin University, China, with research focus including development and evaluation of aquatic ecosystem models, numerical simulation of submerged macrophytes. I have developed the automatic calibration toolkit, EFDC-ACT, for aquatic ecosystem models (downloads exceeding 150). Research InterestMy research interests are deeply rooted in aquatic ecosystems, with a focus on understanding and modeling hydrodynamic, environmental, and ecological interactions within aquatic ecosystems. I am currently engaged in elucidating the ecological roles of submerged macrophytes and developing aquatic ecosystem models to advance management strategies. Education 2024–present PhD candidate, Tianjin University, China 2021–2024 Master of Engineering, Tianjin University, China 2017–2021 Bachelor of Engineering, Tianjin University, China Publications Tianyu Fu, Chen Zhang. Towards a generic model evaluation metric for non-normally distributed measurements in water quality and ecosystem models. 2024, Ecological Informatics, 80, 102470. https://doi.org/10.1016/j.ecoinf.2024.102470 Chen Zhang, Tianyu Fu. Recalibration of a three-dimensional water quality model with a newly developed autocalibration toolkit (EFDC-ACT v1.0.0): how much improvement will be achieved with a wider hydrological variability? 2023, Geoscientific Model Development, 16, 4315–4329. https://doi.org/10.5194/gmd-16-4315-2023 Chen Zhang, Tianyu Fu. Environmental Fluid Dynamics Code Automatic Calibration Toolkit (1.0.0), 2022, Zenodo. [software] https://zenodo.org/records/7438143 Awards and grants 2023 China National Scholarship (SSY202300813) Member of scientific societies 2021–present Member, The International Association for Hydro-Environment Engineering and Research (IAHR) Skills Computer Programming: Fortran (8 yrs); R (5 yrs); Software development; Aquatic Ecosystem Modeling: Hydrodynamic and water quality modeling (EFDC, 4 yrs); Autocalibration; Scientific Visualization: R, Adobe Illustrator, Adobe Photoshop, Origin, Blender (3D), and other tools; Languages: Chinese (Native); English;","link":"/2025/01/23/20250123_CURRICULUM%20VITAE/"},{"title":"From Manual to Automated: How EFDC-ACT Makes Water Quality Models ⚡ Faster | ✔️ More Accurate | 🛡️ More Robust","text":"Author: Tianyu Fu Process-based hydrodynamics-water quality models are powerful tools for unraveling complex cause-effect relationships in aquatic ecosystems. However, increasing model complexity introduces greater parametric uncertainty, which hinders simulation accuracy. Two key challenges persist in model calibration: the inefficiency and subjectivity of traditional trial-and-error methods, and the limited applicability of parameters calibrated using short time-series datasets to broader hydrological conditions. To address these issues, autocalibration techniques enhance calibration efficiency, while employing longer time-series calibration datasets is expected to improve model adaptability across diverse hydrological conditions. Professor Chen Zhang and PhD Student Tianyu Fu from the Department of Hydraulic Engineering at Tianjin University have independently developed EFDC-ACT, an autocalibration toolkit for the 3D hydrodynamics-water quality model EFDC. Their work demonstrates that calibrating water quality models with longer time-series datasets significantly improves performance across a wider hydrological variability and reveals parameter responses to different hydrologic conditions. EFDC-ACT v1.0.0 Autocalibration ToolkitEFDC-ACT v1.0.0 employs the caRamel algorithm for multi-objective iterative optimization of model parameters, providing users with iterative parameter sets, model evaluation metrics, and time-series visualizations. Case studies show that EFDC-ACT reduces pre- and post-processing time from nearly 2 hours manually to under 2 minutes, enabling fully automated calibration and dramatically improving efficiency. Recalibration of Yuqiao Reservoir Water Quality ModelThe original model (Zhang et al., 2013, https://doi.org/10.2166/hydro.2012.131) was calibrated solely using a dry-year dataset. This study recalibrated the model using a continuous decade-long hydrodynamics-water quality dataset encompassing wet, normal, and dry years. The recalibrated model achieved Kling-Gupta Efficiency (KGE) coefficients of 0.10 (Total Phosphorus), 0.30 (Chlorophyll-a), and 0.74 (Dissolved Oxygen), markedly improving upon the original KGEs of -1.60, -3.03, and -0.19, respectively. This confirms the critical role of broader hydrological calibration data in enhancing model accuracy. Parameter Adaptation Insights for Precision GainsCalibrations using single-year datasets (wet, normal, or dry) were compared to decadal strategy. The decadal calibration increased KGE for Total Phosphorus, Chlorophyll-a, and Dissolved Oxygen by up to 196%, 134%, and 202%, respectively. This improvement stems from parameters balancing adaptability across hydrological conditions. For instance, compared to dry-year calibration, the broad-variability strategy reduced the maximum algal growth rate by 46%, basal metabolism rate by 14%, and predation rate by 58%. This maintained Chlorophyll-a accuracy while preventing Dissolved Oxygen overestimation in other hydrologic years. The EFDC-ACT significantly advances water quality modeling efficiency, reducing time and resource costs. Furthermore, this research demonstrates that utilizing calibration datasets with wider hydrological variability substantially improves model accuracy, providing valuable insights for dynamic parameter estimation strategies. The study titled “Recalibration of a three-dimensional water quality model with a newly developed autocalibration toolkit (EFDC-ACT v1.0.0): how much improvement will be achieved with a wider hydrological variability?“ has been published in Geoscientific Model Development. The research paper is available at: https://gmd.copernicus.org/articles/16/4315/2023/. Embracing open-source principles, EFDC-ACT v1.0.0 is publicly available on Zenodo for researchers worldwide. The open-source software is available at: https://zenodo.org/record/7438143. We welcome researchers and model developers to read the full article, download EFDC-ACT, and share your valuable feedback! Special acknowledgment to Professor Zhengang Ji for his constructive comments on the manuscript draft.","link":"/2025/06/01/20250601_From%20Manual%20to%20Automated%20How%20EFDC-ACT%20Makes%20Water%20Quality%20Models/"}],"tags":[],"categories":[],"pages":[{"title":"","text":"/* 全屏静态背景 */ body { background: url(/images/YQ_1.jpg) no-repeat center fixed; background-size: cover; } /* 深色遮罩层（提高文字可读性） */ body::before { content: \"\"; position: fixed; top: 0; left: 0; width: 100%; height: 100%; background: rgba(0,0,0,0.5); /* 透明度调整 */ z-index: -1; }","link":"/css/custom..css"}]}