{"posts":[{"title":"CURRICULUM VITAE","text":"I am a PhD Candidate at Tianjin University, China, with research focus including development and evaluation of aquatic ecosystem models, numerical simulation of submerged macrophytes. I have developed the automatic calibration tool for aquatic ecosystem models, EFDC-ACT (downloads exceeding 100). Research InterestMy research interests are deeply rooted in aquatic ecosystems, with a focus on understanding and modeling hydrodynamic, environmental, and ecological interactions within aquatic ecosystems. I am currently engaged in elucidating the ecological roles of submerged macrophytes and developing aquatic ecosystem models to advance management strategies. Education 2024–present PhD candidate, Tianjin University, China 2021–2024 Master of Engineering, Tianjin University, China 2017–2021 Bachelor of Engineering, Tianjin University, China Publications Tianyu Fu, Chen Zhang. Towards a generic model evaluation metric for non-normally distributed measurements in water quality and ecosystem models. 2024, Ecological Informatics, 80, 102470. https://doi.org/10.1016/j.ecoinf.2024.102470 Chen Zhang, Tianyu Fu. Recalibration of a three-dimensional water quality model with a newly developed autocalibration toolkit (EFDC-ACT v1.0.0): how much improvement will be achieved with a wider hydrological variability? 2023, Geoscientific Model Development, 16, 4315–4329. https://doi.org/10.5194/gmd-16-4315-2023 Chen Zhang, Tianyu Fu. Environmental Fluid Dynamics Code Automatic Calibration Toolkit (1.0.0), 2022, Zenodo. [software] https://zenodo.org/records/7438143 Awards and grants 2023 China National Scholarship (SSY202300813) Member of scientific societies 2021–present Member, The International Association for Hydro-Environment Engineering and Research (IAHR) Skills Computer Programming: Fortran (8 yrs); R (5 yrs); Software development; Aquatic Ecosystem Modeling: Hydrodynamic and water quality modeling (EFDC, 4 yrs); Autocalibration; Scientific Visualization: R, Adobe Illustrator, Adobe Photoshop, Origin, Blender (3D), and other tools. Languages: Chinese (Native); English;","link":"/2025/01/23/CURRICULUM%20VITAE/"}],"tags":[],"categories":[],"pages":[{"title":"","text":"/* 全屏静态背景 */ body { background: url(/images/YQ_1.jpg) no-repeat center fixed; background-size: cover; } /* 深色遮罩层（提高文字可读性） */ body::before { content: \"\"; position: fixed; top: 0; left: 0; width: 100%; height: 100%; background: rgba(0,0,0,0.5); /* 透明度调整 */ z-index: -1; }","link":"/css/custom..css"}]}